Учет_кабельной_продукции/src/InformationRegisters/ДанныеЖурналовУчетаКП/ДанныеЖурналовУчетаКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЖурналовУчетаКП</name>
  <resources>
    <name>Изм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерНитки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОткудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаКоординаты</name>
    <type>
      <types>CatalogRef.Координаты</types>
    </type>
  </resources>
  <resources>
    <name>КудаПомещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КудаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обозначение2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаПроектная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусКабельнойЛинии</name>
    <type>
      <types>EnumRef.СтатусыКабельныхЛиний</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаКабеля</name>
    <type>
      <types>CatalogRef.МаркиКабели</types>
    </type>
  </resources>
  <dimensions>
    <name>ЖурналКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/InformationRegisters/ЗаданияНаЗакупкиСтатусы/ЗаданияНаЗакупкиСтатусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияНаЗакупкиСтатусы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КабельнаяЛиния</name>
    <type>
      <types>CatalogRef.КабельныеЛинии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_кабельной_продукции/src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>НужноСделать</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>Готово</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыЗаданийНаЗакупку/СтатусыЗаданийНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаданийНаЗакупку</name>
  <enumValues>
    <name>ВыданоПодрядчику</name>
  </enumValues>
  <enumValues>
    <name>НаДоработке</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>Аннулировано</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыЗаявкиНаЗакупку/СтатусыЗаявкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкиНаЗакупку</name>
  <enumValues>
    <name>ОжидаетЗаявку</name>
  </enumValues>
  <enumValues>
    <name>ЗаключениеДоговора</name>
  </enumValues>
  <enumValues>
    <name>Изготовление</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Поставлено</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Enums/СтатусыЗаявкиНаМонтаж/СтатусыЗаявкиНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкиНаМонтаж</name>
  <enumValues>
    <name>НеВыполнено</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

Учет_кабельной_продукции/src/Documents/ЗаданияНаЗакупку/ЗаданияНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаЗакупку</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаданияНаЗакупкиСтатусы</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаЗакупку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Принято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкиНаЗакупки/ЗаявкиНаЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкиНаЗакупки</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ДанныеПоЗаявкамНаЗакупку</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаЗакупку</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>299</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВКНаКПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>299</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/ЗаявкаНаМонтаж/ЗаявкаНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМонтаж</name>
  <basedOn>Catalog.ЖурналыУчетаКабельнойПродукции</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЗаявкиНаМонтажСтатусы</registerRecords>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <registerRecords>InformationRegister.РазрешениеМонтажаКПП</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаМонтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиВМонтаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КабельныеЛинии</name>
    <attributes>
      <name>ЖурналУчетаКП</name>
      <type>
        <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>КабельнаяЛиния</name>
      <type>
        <types>CatalogRef.КабельныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьМонтаж</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_кабельной_продукции/src/CommonForms/ФормаРабочаяОбласть/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Выборка = Справочники.Подрядчик.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВыбораПодрядчика.Добавить(Выборка.Ссылка, Выборка.Ссылка);		
	КонецЦикла;
	
	ПрочитатьПроектныйКабельныйЖурнал();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьЗаданияНаЗакупку(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗадниеНаЗакупку");	     
	ПараметрыОбъекта.Вставить("Подрядчик", ОбщегоНазначенияПереопределяемый.ПодрядчикТекущегоПользователя());	    			
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьЗаявкиНаЗакупку(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗаявкиНаЗакупку");	
	ПараметрыОбъекта.Вставить("ОтборыКабельныхЛиний", "ПоРегиструЗаданияЗакупкиПринятыеКабельныеЛинии");
	ПараметрыОбъекта.Вставить("Подрядчик", ОбщегоНазначенияПереопределяемый.ПодрядчикТекущегоПользователя());	    			
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкиНаМонтаж(Команда)
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбъекта.Вставить("СписокВыбораПодрядчика", СписокВыбораПодрядчика);
	ПараметрыОбъекта.Вставить("ИмяОбъекта", "ЗаявкаНаМонтаж");	
	ПараметрыОбъекта.Вставить("ОтборыКабельныхЛиний", "ОтборВКПройден");	
	ПараметрыОбъекта.Вставить("Подрядчик", ОбщегоНазначенияПереопределяемый.ПодрядчикТекущегоПользователя());	    			
	ФормыДокументовОбработчикиКоманд.ВыборПодрядчикаИКабельныеЛинии(ПараметрыОбъекта);
		
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийСтраниц  
&НаКлиенте
Процедура СтраницыРабочейОбластиПриСменеСтраницы(Элемент, ТекущаяСтраница)

	ПрочитатьПроектныйКабельныйЖурнал();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПеремещенияЗадачСписокЗадач   
&НаКлиенте
Процедура ЗадачиНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НужноСделать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиТестированиеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Тестирование"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	ОбновитьСтатусыЗадачКлиент(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВРаботе"));
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбновитьСтатусыЗадачКлиент(МассивЗадач, НовыйСтатус)

	Если ТипЗнч(МассивЗадач) = Тип("Массив") Тогда 
		ОбновитьСтатусыЗадач(МассивЗадач, НовыйСтатус);
	КонецЕсли;	
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователям"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСтатусыЗадач(МассивЗадач, НовыйСтатус) 
	
	Для Каждого ТекЗадча Из МассивЗадач Цикл   
		
		ЗадачаОбъект = ТекЗадча.ПолучитьОбъект();   
		Если ЗадачаОбъект.Статус = НовыйСтатус Тогда 			
			Продолжить;
		КонецЕсли;
		
		Если НовыйСтатус = Перечисления.СтатусыЗадач.Готово Тогда
			ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;	
		
		ЗадачаОбъект.Статус	= НовыйСтатус;   
		Попытка
			ЗадачаОбъект.Записать();    
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Не удалось изменить статус задачи " 
				+ ТекЗадча + " по причине " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры	
#КонецОбласти

#Область ПрочиеПроцедурыИФункции
&НаСервереБезКонтекста
Функция СоздатьЗаданиеНаЗакупки(Подрядчик, МассивДанныхЗагрузкиТЧ) Экспорт
	
	НовоеЗадание                 = Документы.ЗаданияНаЗакупку.СоздатьДокумент();
	НовоеЗадание.Дата            = ТекущаяДатаСеанса();
	НовоеЗадание.СтатусДокумента = Перечисления.СтатусыЗаданийНаЗакупку.ВыданоПодрядчику; 
	НовоеЗадание.Подрядчик       = Подрядчик;
	
	Для каждого ТекКабельнаяЛиния Из МассивДанныхЗагрузкиТЧ Цикл
		НовКабельнаяЛиния                = НовоеЗадание.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния = ТекКабельнаяЛиния.КабельнаяЛиния;     
		НовКабельнаяЛиния.ЖурналУчетаКП  = ТекКабельнаяЛиния.ЖурналУчетаКП;     		
		НовКабельнаяЛиния.Принято        = Истина;
	КонецЦикла;
	
	НовоеЗадание.Записать();
	
	Возврат НовоеЗадание.Ссылка; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьЗаявкуНаЗакупки(Подрядчик, МассивДанныхЗагрузкиТЧ) Экспорт
	
	НоваяЗаявка           = Документы.ЗаявкиНаЗакупки.СоздатьДокумент();
	НоваяЗаявка.Дата      = ТекущаяДатаСеанса();
	НоваяЗаявка.Статус    = Перечисления.СтатусыЗаявкиНаЗакупку.ОжидаетЗаявку; 
	НоваяЗаявка.Подрядчик = Подрядчик;
	
	Для каждого ТекКабельнаяЛиния Из МассивДанныхЗагрузкиТЧ Цикл
		НовКабельнаяЛиния                = НоваяЗаявка.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния = ТекКабельнаяЛиния.КабельнаяЛиния;     
		НовКабельнаяЛиния.ЖурналУчетаКП  = ТекКабельнаяЛиния.ЖурналУчетаКП;     				
	КонецЦикла;
	
	НоваяЗаявка.Записать();
	
	Возврат НоваяЗаявка.Ссылка; 
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьЗаявкуНаМонтаж(Подрядчик, МассивДанныхЗагрузкиТЧ) Экспорт
	
	НоваяЗаявка           = Документы.ЗаявкаНаМонтаж.СоздатьДокумент();
	НоваяЗаявка.Дата      = ТекущаяДатаСеанса();
	НоваяЗаявка.Статус    = Перечисления.СтатусыЗаявкиНаМонтаж.НеВыполнено; 
	НоваяЗаявка.Подрядчик = Подрядчик;
	
	Для Каждого ТекКабельнаяЛиния Из МассивДанныхЗагрузкиТЧ Цикл
		НовКабельнаяЛиния                 = НоваяЗаявка.КабельныеЛинии.Добавить();
		НовКабельнаяЛиния.КабельнаяЛиния  = ТекКабельнаяЛиния.КабельнаяЛиния;     
		НовКабельнаяЛиния.ЖурналУчетаКП   = ТекКабельнаяЛиния.ЖурналУчетаКП;   
		НовКабельнаяЛиния.РазрешитьМонтаж = Ложь;
	КонецЦикла;
	
	НоваяЗаявка.Записать();	
	Возврат НоваяЗаявка.Ссылка; 
	
КонецФункции

&НаСервере
Процедура ПрочитатьПроектныйКабельныйЖурнал()
	
	Запрос       = Новый Запрос;
	Запрос.Текст = ЗапросДляЧтенияПроектныйКабельныйЖурнал();	
	
	ДанныеИзБазыДляУчетаКП = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ЗначениеВРеквизитФормы(ДанныеИзБазыДляУчетаКП, "ПроектныйКабельныйЖурнал");	
	
КонецПроцедуры	

&НаСервере
Функция ЗапросДляЧтенияПроектныйКабельныйЖурнал()  
	
	ЗапросТекст =  "ВЫБРАТЬ
	               |	ДанныеБазыЖурнал.ЖурналКабельнойПродукции КАК ЖурналКабельнойПродукции,
				   |	ДанныеБазыЖурнал.Изм КАК Изм,
				   |	ДанныеБазыЖурнал.ЖурналКабельнойПродукции.Объект КАК Объект,
				   |	ДанныеБазыЖурнал.МаркировкаКабеля.Наименование КАК МаркировкаКабеля,
				   |	ДанныеБазыЖурнал.КабельнаяЛиния.МаркировкаКабеляПроектная.Наименование КАК МаркировкаКабеляПроектная,
				   |	ДанныеБазыЖурнал.КабельнаяЛиния.СечениеПроектное.Наименование КАК СечениеПроектное,
				   |	ДанныеБазыЖурнал.КабельнаяЛиния.КлассБезопасности КАК КлассБезопасности,
				   |	ДанныеБазыЖурнал.ОткудаПомещение КАК ОткудаПомещение,
				   |	ДанныеБазыЖурнал.ОткудаОборудование КАК ОткудаОборудование,
				   |	ДанныеБазыЖурнал.ОткудаКоординаты КАК ОткудаКоординаты,
				   |	ДанныеБазыЖурнал.КудаПомещение КАК КудаПомещение,
				   |	ДанныеБазыЖурнал.КудаОборудование КАК КудаОборудование,
				   |	ДанныеБазыЖурнал.КудаКоординаты КАК КудаКоординаты,
				   |	ДанныеБазыЖурнал.ДлинаПроектная КАК ДлинаПроектная,
				   |	ДанныеБазыЖурнал.ДлинаФактическая КАК ДлинаФактическая,
				   |	ДанныеБазыЖурнал.ЖурналКабельнойПродукции.Трассировка КАК Трассировка,
				   |	ДанныеБазыЖурнал.СтатусКабельнойЛинии КАК Статус,
				   |	ДанныеБазыЖурнал.КабельнаяЛиния КАК КабельнаяЛиния,
				   |	ЗаданияНаЗакупкиСтатусы.Статус КАК СтатусЗаданияНаЗакупку,
				   |	ЗаданияНаЗакупкиСтатусы.Номер КАК НомерЗаданияНаЗакупку,
				   |	ЗаданияНаЗакупкиСтатусы.Дата КАК ДатаЗаданияНаЗакупку
	               |ИЗ
	               |	РегистрСведений.ДанныеЖурналовУчетаКП КАК ДанныеБазыЖурнал
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияНаЗакупкиСтатусы КАК ЗаданияНаЗакупкиСтатусы
	               |		ПО ДанныеБазыЖурнал.КабельнаяЛиния = ЗаданияНаЗакупкиСтатусы.КабельнаяЛиния
	               |ГДЕ
	               |	1 = 1
				   |ИТОГИ
				   //|	МАКСИМУМ(Объект),
				   //|	МАКСИМУМ(Трассировка)
	               |ПО
	               |	ЖурналКабельнойПродукции";
	
	Возврат ЗапросТекст;
	
КонецФункции	
#КонецОбласти
